Tekla Open API Reference for Tekla Structures 2025
UserPropertyItemEnumerator Properties
The UserPropertyItemEnumerator type exposes the following members.
Properties
Name | Description
Current
 Returns a user property item instance of the current element.
Top
See Also
Reference
UserPropertyItemEnumerator Class
Tekla.Structures.Catalogs Namespace